In [3]:
import pandas as pd
dict_data = {'a': 1, 'b': 2, 'c': 3}
sr = pd.Series(dict_data)
sr

a    1
b    2
c    3
dtype: int64

In [8]:
sr["c"]

3

In [9]:
for i in sr :
    print(i)

1
2
3

In [11]:
for k,v in sr.items():
    print(f'{k} , {v}')

a , 1
b , 2
c , 3

In [4]:
for k in sr.keys():
    print(f'{k}의 값 {sr[k]}')

a의 값 1
b의 값 2
c의 값 3

In [5]:
# Data = Series객체[ index 
for v in sr.values:
    print(v)

1
2
3

In [7]:
# sr.index
# sr.values

Index(['a', 'b', 'c'], dtype='object')

In [8]:
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [9]:
sr[1:3]

생년월일    2010-05-01
성별               여
dtype: object

In [10]:
#데이터 프레임 생성
# dataframe = pd.DataFrame( data,
# index= 행 인덱스 배열,
# column= 열 이름 배열 )

# 파이썬 dict, ndarray. 스칼라 값

In [14]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [12]:
type(df)

pandas.core.frame.DataFrame

In [8]:
# DataFrame객체.rename( index={ 기존인덱스: 새 인덱스, ….. },inplace )
# DataFrame객체.rename( columns={ 기존인덱스: 새 인덱스, ….. },inplace)

df.rename(index={0:"첫번째"},inplace=True)
df

     c0  c1  c2  c3  c4
첫번째   1   4   7  10  13
1     2   5   8  11  14
2     3   6   9  12  15

In [15]:
df.rename(columns={'c0':'첫번째 열'},inplace=True)
df

   첫번째 열  c1  c2  c3  c4
0      1   4   7  10  13
1      2   5   8  11  14
2      3   6   9  12  15

In [17]:
#삭제
df.drop('c1',axis = 1, inplace=True)
df

   첫번째 열  c2  c3  c4
0      1   7  10  13
1      2   8  11  14
2      3   9  12  15

In [24]:
# 재생성
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [23]:
# df.drop(index=[0,1],inplace=True) 배열 삭제 / 행삭제 
df.drop(columns=["c0","c1"],inplace=True)  
df

   c2  c3  c4
0   7  10  13
1   8  11  14
2   9  12  15

In [120]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}


df = pd.DataFrame(exam_data)
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [122]:
# Length of values (3) does not match length of index (2)
df = pd.DataFrame(exam_data, index=['서준', '우현','홍열'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
홍열  70  95  100   90

In [130]:
# df.iloc[0:2,0:2]
df.loc["서준":"홍열"]
df.loc[["서준","홍열"]] #인덱싱을 할 때는 괄호 [], 통째로 가져올때는 [[]] 이유 ! 질문!

    수학  영어   음악   체육
서준  90  98   85  100
홍열  70  95  100   90

In [117]:
df.loc[['서준',"우현"]][["수학","체육"]]  #str은 마지막 열까지 포함 #질문하기

    수학   체육
이름
서준  90  100
우현  80   90

In [113]:
type(df.loc[["서준"]]), type(df.loc["서준"])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [115]:
df.loc["서준"]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [68]:
df.영어

서준    98
우현    89
홍열    95
Name: 영어, dtype: int64

In [70]:
df[["수학","영어"]] #하나씩 꺼내서 표 만들기! #질문 #리스트 안에 리스트를 넣는 이유
# df["수학","영어"]
# df["수학"]

    수학  영어
서준  90  98
우현  80  89
홍열  70  95

In [71]:
df["수학"]

서준    90
우현    80
홍열    70
Name: 수학, dtype: int64

In [72]:
df[["수학"]]

    수학
서준  90
우현  80
홍열  70

In [74]:
# DataFrame객체.loc[ 행이름, 열이름 ]
# DataFrame객체.iloc[ 행번호, 열번호 ]

df.iloc[:2,:2]

    수학  영어
서준  90  98
우현  80  89

In [80]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [81]:
# '열을' 새로운 인덱스로 지정하고, df 객체로 변경사항 반영
df.set_index("수학",inplace=True)
df

    이름  영어   음악   체육
수학
90  서준  98   85  100
80  우현  89   95   90
70  인아  95  100   90

In [82]:
df.reset_index(inplace=True)
df

   수학  이름  영어   음악   체육
0  90  서준  98   85  100
1  80  우현  89   95   90
2  70  인아  95  100   90

In [83]:
df.reset_index(inplace=True)
df

   index  수학  이름  영어   음악   체육
0      0  90  서준  98   85  100
1      1  80  우현  89   95   90
2      2  70  인아  95  100   90

In [93]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)

exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [94]:
#질문 뒤의 열은 왜 리스트 안에 리스트가 아닌가?
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [97]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
print(a)

85

In [102]:
# df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)
type(df.loc["서준"])
# df.loc["서준"] #시리즈

pandas.core.series.Series

In [135]:
df.loc[["서준"],"수학":"음악"]

    수학  영어  음악
서준  90  98  85

In [132]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
홍열  70  95  100   90

In [3]:
#행열추가
import pandas as pd

exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [145]:
# df['국어'] = 80

In [4]:
df.loc[4] = ['동규', 90, 80, 70, 60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
4  동규  90  80   70   60

In [10]:
df['국어'] = [90, 80, 70, 60]
df['미술'] = 90, 80, 70, 60

df

   이름  수학  영어   음악   체육  국어  미술
0  서준  90  98   85  100  90  90
1  우현  80  89   95   90  80  80
2  인아  70  95  100   90  70  70
4  동규  90  80   70   60  60  60

In [162]:
type(df['국어']), type(df['미술'])

(pandas.core.series.Series, pandas.core.series.Series)

In [165]:
for i in df['국어'].keys(): #국어 => 시리즈내임
    print(i)

0
1
2
4

In [6]:
df['국어']

KeyError: '국어'

In [12]:
df['국어'].rename("한국어",inplace=True)
df

   이름  수학  영어   음악   체육  국어  미술
0  서준  90  98   85  100  90  90
1  우현  80  89   95   90  80  80
2  인아  70  95  100   90  70  70
4  동규  90  80   70   60  60  60

In [15]:
df

   이름  수학  영어   음악   체육  국어  미술
0  서준  90  98   85  100  90  90
1  우현  80  89   95   90  80  80
2  인아  70  95  100   90  70  70
4  동규  90  80   70   60  60  60

In [1]:
df.T

NameError: name 'df' is not defined

In [5]:
#행열추가
import pandas as pd

exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
df.T

In [9]:
df.transpose()

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [3]:
df.set_index("이름",inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
new_index = ['r0', 'r1', 'r2']
df.reindex(new_index)

In [1]:
#행인덱스 재배열
import pandas as pd
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],
'c3':[10,11,12], 'c4':[13,14,15]}
# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

# 인덱스를 [r0, r1, r2, r3, r4]로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

# reindex로 발생한 NaN값을 숫자 0으로 채우기
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [2]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12],
'c4':[13,14,15]}
# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [3]:
ndf = df.reset_index()
print(ndf)

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [12]:
import pandas as pd

exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df)

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12],
'c4':[13,14,15]}
# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
# df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df = pd.DataFrame(dict_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [13]:
import pandas as pd
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12],
'c4':[13,14,15]}
# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)
# 내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [15]:
import pandas as pd
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12],
'c4':[13,14,15]}
# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)
# c1 열을 기준으로 내림차순 정렬
ndf = df.sort_values(by='c1', ascending=False)
print(ndf)
print(ndf.T) #질문

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13
    r2  r1  r0
c0   3   2   1
c1   6   5   4
c2   9   8   7
c3  12  11  10
c4  15  14  13

In [22]:
#연산자
import pandas as pd
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
print(student1)
print(student2)

# 두 학생의 과목별 점수로 사칙연산 수행
addition = student1 + student2 #덧셈
subtraction = student1 - student2 #뺄셈
multiplication = student1 * student2 #곱셈
division = student1 / student2 #나눗셈
print(type(division))

result2 = pd.DataFrame(addition)
print(result2)

result = pd.DataFrame( [ addition, subtraction,
multiplication, division],
index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

국어    100
영어     80
수학     90
dtype: int64
수학    80
국어    90
영어    80
dtype: int64
<class 'pandas.core.series.Series'>
      0
국어  190
수학  170
영어  160
              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [23]:
import pandas as pd
exam_data = { '이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
print(df)
# 데이터프레임에 숫자 2 곱하기
df2 = df * 2
print(df2)
print(type(df2))

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
     수학   영어   음악   체육
이름
서준  180  196  170  200
우현  160  178  190  180
인아  140  190  200  180
<class 'pandas.core.frame.DataFrame'>

In [24]:
import urllib.request
# URL과 저장 경로 지정
url = "http://uta.pw/shodou/img/28/214.png"
savename = "test.png"
# 파일 형태로 다운로드
urllib.request.urlretrieve( url, savename )
print("저장되었습니다...!")

저장되었습니다...!

In [26]:
import urllib.request
# 데이터 읽어 들이기
url = "http://api.aoikujira.com/ip/ini"
res = urllib.request.urlopen(url)
data = res.read() # 바이트 데이터 읽어오기
print('type(data) =', type(data)) # 타입 체크
# 바이너리를 문자열로 변환하기
text = data.decode("utf-8")
print(text)

type(data) = <class 'bytes'>
[ip]
API_URI=http://api.aoikujira.com/ip/get.php
REMOTE_ADDR=123.215.92.176
REMOTE_HOST=123.215.92.176
REMOTE_PORT=57224
HTTP_HOST=api.aoikujira.com
HTTP_USER_AGENT=Python-urllib/3.9
HTTP_ACCEPT_LANGUAGE=
HTTP_ACCEPT_CHARSET=
SERVER_PORT=80
FORMAT=ini